am32-firmware/AM32/svd/stm32h7/STM32H725.svd
        <register>
          <name>SHSR2</name>
          <displayName>SHSR2</displayName>
          <description>DAC Sample and Hold sample time register
          2</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAMPLE2</name>
              <description>DAC Channel 2 sample Time (only valid in
              sample &amp;amp; hold mode) These bits can be written
              when the DAC channel2 is disabled or also during
              normal operation. in the latter case, the write can
              be done only when BWSTx of DAC_SR register is low, if
              BWSTx=1, the write operation is
              ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHHR</name>
          <displayName>SHHR</displayName>
          <description>DAC Sample and Hold hold time
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>THOLD1</name>
              <description>DAC Channel 1 hold Time (only valid in
              sample &amp;amp; hold mode) Hold time= (THOLD[9:0]) x
              T LSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>THOLD2</name>
              <description>DAC Channel 2 hold time (only valid in
              sample &amp;amp; hold mode). Hold time= (THOLD[9:0])
              x T LSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHRR</name>
          <displayName>SHRR</displayName>
          <description>DAC Sample and Hold refresh time
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>TREFRESH1</name>
              <description>DAC Channel 1 refresh Time (only valid
              in sample &amp;amp; hold mode) Refresh time=
              (TREFRESH[7:0]) x T LSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TREFRESH2</name>
              <description>DAC Channel 2 refresh Time (only valid
              in sample &amp;amp; hold mode) Refresh time=
              (TREFRESH[7:0]) x T LSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
         <name>DBGMCU</name>
         <description>Microcontroller Debug Unit</description>
         <groupName>DBGMCU</groupName>
         <baseAddress>0x5C001000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IDC</name>
               <displayName>IDC</displayName>
               <description>DBGMCU Identity Code Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x10006450</resetValue>
               <fields>
                  <field>
                     <name>DEV_ID</name>
                     <description>Device ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>DBGMCU Configuration Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBGSLPD1</name>
                     <description> Allow D1 domain debug in Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTPD1</name>
                     <description>Allow D1 domain debug in Stop mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTBD1</name>
                     <description>Allow D1 domain debug in Standby mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                 
				  <field>
                     <name>DBGSLPD2</name>
                     <description> Allow D2 domain debug in Sleep mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTPD2</name>
                     <description>Allow D2 domain debug in Stop mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTBD2</name>
                     <description> Allow D2 domain debug in Standby mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBGSTPD3</name>
                     <description>Allow debug in D3 Stop mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGSTBD3</name>
                     <description>Allow debug in D3 Standby mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				
				  <field>
                     <name>TRACECLKEN</name>
                     <description>Trace port clock enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>D1DBGCKEN</name>
                     <description> D1 debug clock enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D3DBGCKEN</name>
                     <description>D3 debug clock enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>TRGOEN</name>
                     <description>External trigger output enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  
               </fields>
            </register>
            <register>
               <name>APB3FZ1</name>
               <displayName>APB3FZ1</displayName>
               <description>DBGMCU APB3 peripheral freeze register CPU1</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WWDG1</name>
                     <description>WWDG1 stop in debug</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                                                 
               </fields>
            </register>  
            <register>
               <name>APB3FZ2</name>
               <displayName>APB3FZ2</displayName>
               <description>DBGMCU APB3 peripheral freeze register CPU2</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WWDG1</name>
                     <description>WWDG1 stop in debug</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                                                     
               </fields>
            </register>			
			<register>
               <name>APB1LFZ1</name>
               <displayName>APB1LFZ1</displayName>
               <description>DBGMCU APB1L peripheral freeze register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM2</name>
                     <description>TIM2 stop in debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM3</name>
                     <description>TIM3 stop in debug</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM4</name>
                     <description>TIM4 stop in debug</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM5</name>
                     <description>TIM5 stop in debug</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM6</name>
                     <description>TIM6 stop in debug</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM7</name>
                     <description>TIM7 stop in debug</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM12</name>
                     <description>TIM12 stop in debug</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM13</name>
                     <description>TIM13 stop in debug</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				   <field>
                     <name>DBG_TIM14</name>
                     <description>TIM14 stop in debug</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				   <field>
                     <name>DBG_LPTIM1</name>
                     <description> LPTIM1 stop in debug</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WWDG2</name>
                     <description>WWDG2 stop in debug</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  
				  <field>
                     <name>DBG_I2C1</name>
                     <description> I2C1 SMBUS timeout stop in debug </description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_I2C2</name>
                     <description> I2C2 SMBUS timeout stop in debug</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_I2C3</name>
                     <description> I2C3 SMBUS timeout stop in debug</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				   
               </fields>
            </register> 
            <register>
               <name>APB1LFZ2</name>
               <displayName>APB1LFZ2</displayName>
               <description>DBGMCU APB1L peripheral freeze register CPU2</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM2</name>
                     <description>TIM2 stop in debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM3</name>
                     <description>TIM3 stop in debug</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				   <field>
                     <name>DBG_TIM4</name>
                     <description>TIM4 stop in debug</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM5</name>
                     <description>TIM5 stop in debug</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM6</name>
                     <description>TIM6 stop in debug</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM7</name>
                     <description>TIM4 stop in debug</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM12</name>
                     <description>TIM12 stop in debug</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM13</name>
                     <description>TIM13 stop in debug</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM14</name>
                     <description> TIM14 stop in debug</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_LPTIM1</name>
                     <description>LPTIM1 stop in debug</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_WWDG2</name>
                     <description>WWDG2 stop in debug</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_I2C1</name>
                     <description>I2C1 SMBUS timeout stop in debug</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_I2C2</name>
                     <description> I2C2 SMBUS timeout stop in debug</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_I2C3</name>
                     <description> I2C3 SMBUS timeout stop in debug</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>                  
               </fields>
            </register>				
            <register>
               <name>APB2FZ1</name>
               <displayName>APB2FZ1</displayName>
               <description>DBGMCU APB2 peripheral freeze register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM1</name>
                     <description> TIM1 stop in debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM8</name>
                     <description> TIM8 stop in debug</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM15</name>
                     <description>TIM15 stop in debug</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM16</name>
                     <description>TIM16 stop in debug</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM17</name>
                     <description> TIM17 stop in debug</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  
               </fields>
            </register>	
            <register>
               <name>APB2FZ2</name>
               <displayName>APB2FZ2</displayName>
               <description>DBGMCU APB2 peripheral freeze register CPU2</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIM1</name>
                     <description>TIM1 stop in debug</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIM8</name>
                     <description>TIM8 stop in debug</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM15</name>
                     <description>TIM15 stop in debug</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM16</name>
                     <description> TIM16 stop in debug</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_TIM17</name>
                     <description>TIM17 stop in debug</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>				  
               </fields>
            </register>			
            <register>
               <name>APB4FZ1</name>
               <displayName>APB4FZ1</displayName>
               <description>DBGMCU APB4 peripheral freeze register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
			      <field>
                     <name>DBG_I2C4</name>
                     <description>I2C4 SMBUS timeout stop in debug</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
			      <field>
                     <name>DBG_LPTIM2</name>
                     <description> LPTIM2 stop in debug</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
			      <field>
                     <name>DBG_LPTIM3</name>
                     <description> LPTIM2 stop in debug</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIM4</name>
                     <description>LPTIM4 stop in debug</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIM5</name>
                     <description>LPTIM5 stop in debug</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
				  <field>
                     <name>DBG_RTC</name>
                     <description>RTC stop in debug</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WDGLSD1</name>
                     <description>Independent watchdog for D1 stop in debug</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WDGLSD2</name>
                     <description> Independent watchdog for D2 stop in debug</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>					  
               </fields>
            </register>
