am32-firmware/AM32/svd/stm32h7/STM32H725.svd
        <register>
          <name>OSPEEDR</name>
          <displayName>OSPEEDR</displayName>
          <description>GPIO port output speed
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0C000000</resetValue>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED12</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED13</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED14</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OSPEED15</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O output speed. Note: Refer to the
              device datasheet for the frequency specifications and
              the power supply and load conditions for each
              speed.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <displayName>PUPDR</displayName>
          <description>GPIO port pull-up/pull-down
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x12100000</resetValue>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD1</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD2</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD3</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD4</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD5</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD6</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD7</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD8</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD9</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD10</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD11</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD12</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD13</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD14</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD15</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>GPIO port input data register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID0</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID1</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID2</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID3</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID4</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID5</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID6</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID7</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID8</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID9</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID10</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID11</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID12</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID13</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID14</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID15</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
