am32-firmware/AM32/svd/stm32h7/STM32H725.svd
          <register>
            <name>OTFDEC_IER</name>
            <displayName>OTFDEC_IER</displayName>
            <description>OTFDEC interrupt enable register </description>
            <addressOffset>0x308</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SEIE</name>
                <description>Security Error Interrupt Enable
This bit is read and written by application. It controls the OTFDEC interrupt generation when SEIF flag status is set.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Interrupt generation on security error SEIF is disabled (masked)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Interrupt generation on security error SEIF is enabled (not masked)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>XONEIE</name>
                <description>Execute-only execute-Never Error Interrupt Enable
This bit is read and written by application. It controls the OTFDEC interrupt generation when XONEIF flag status is set.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Interrupt generation on execute-only error XONEIF is disabled (masked)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Interrupt generation on execute-only error XONEIF is enabled (not masked)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEIE</name>
                <description>Key Error Interrupt Enable
This bit is read and written by application. It controls the OTFDEC interrupt generation when KEIF flag status is set.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Interrupt generation on key error flag KEIF is disabled (masked)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Interrupt generation on key error flag KEIF is enabled (not masked)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </registers>
    </peripheral>
	<peripheral derivedFrom="OTFDEC1">
      <name>OTFDEC2</name>
      <baseAddress>0x5200BC00</baseAddress>
	  <interrupt>
        <name>OTFDEC2</name>
        <description>OTFDEC2 interrupt</description>
        <value>152</value>
      </interrupt>
    </peripheral>
	<peripheral>
      <name>PF</name>
      <description>Processor features</description>
      <groupName>PF</groupName>
      <baseAddress>0xE000ED78</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLIDR</name>
          <displayName>CLIDR</displayName>
          <description>Cache Level ID register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x09000003</resetValue>
          <fields>
            <field>
              <name>CL1</name>
              <description>CL1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CL2</name>
              <description>CL2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CL3</name>
              <description>CL3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CL4</name>
              <description>CL4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CL5</name>
              <description>CL5</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CL6</name>
              <description>CL6</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CL7</name>
              <description>CL7</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LoUIS</name>
              <description>LoUIS</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LoC</name>
              <description>LoC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LoU</name>
              <description>LoU</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR</name>
          <displayName>CTR</displayName>
          <description>Cache Type register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0X8303C003</resetValue>
          <fields>
            <field>
              <name>_IminLine</name>
              <description>IminLine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DMinLine</name>
              <description>DMinLine</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ERG</name>
              <description>ERG</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CWG</name>
              <description>CWG</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Format</name>
              <description>Format</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSIDR</name>
          <displayName>CCSIDR</displayName>
          <description>Cache Size ID register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>LineSize</name>
              <description>LineSize</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>Associativity</name>
              <description>Associativity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>NumSets</name>
              <description>NumSets</description>
              <bitOffset>13</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>WA</name>
              <description>WA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>RA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WB</name>
              <description>WB</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WT</name>
              <description>WT</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
